# ===========   1.3.1	开发第一个Python程序   ===========
# phone_num = input('请输入要充值的手机号码：')
# recharge_amount = input('请输入要充值的金额：')
# print('手机号码', phone_num, '成功充值', recharge_amount, '元')


# ===========   1.3.3	数据的表示——变量   ===========
# fromNo12    							# 合法的变量名
# my_func                                  # 合法的变量名
# from#12     							# 不合法的变量名，不能包含#符号
# 2ndObj      							# 不合法的变量名，不能以数字开头
# if       						     # 不合法的变量名，不能使用关键字if

# words = '读万卷书，行万里路'
# print(words)


# ===========   1.3.4	基本输入输出   ===========
# user_name = input('请输入账号：')      # 接收用户输入的账号
# password = input('请输入密码：')       # 接收用户输入的密码
# print('登录成功！')

name = '小明'
print('姓名：', name)      # 输出多个数据，第一个是字符串，第二个是变量保存的数据
print('年龄: 22')          # 输出一个数据
address = '北京'
print('地址：', address)  # 输出多个数据，第一个是字符串，第二个是变量保存的数据

