profit = float(input("请输入当月的利润（元）："))    # 当月的利润
bonus = 0                                               # 当月的奖金
if profit <= 100000:                # 利润小于或等于100000
    bonus = 100000 * 0.1
elif 100000 < profit <= 200000:   # 利润大于100000且小于等于200000
    bonus = 100000 * 0.1 + (profit - 100000) * 0.075
elif 200000 < profit <= 400000:   # 利润大于200000且小于等于400000
    bonus = 100000 * 0.1 + 100000 * 0.075 + (profit - 200000) * 0.05
elif 400000 < profit <= 600000:   # 利润大于400000且小于等于600000
    bonus = 100000 * 0.1 + 100000 * 0.075 + 200000 * 0.05 + \
            (profit - 400000) * 0.03
elif 600000 < profit <= 1000000:  # 利润大于600000且小于等于1000000
    bonus = 100000 * 0.1 + 100000 * 0.075 + 200000 * 0.05 + \
            200000 * 0.03 + (profit - 600000) * 0.015
elif profit > 1000000:             # 利润大于1000000
    bonus = 100000 * 0.1 + 100000 * 0.075 + \
            200000 * 0.05 + 200000 * 0.03 + \
            400000 * 0.015 + (profit - 1000000) * 0.01
print('当月应发放的奖金为 %s 元' % bonus)
